sdw333/nRF5_SDK/components/ble/peer_manager/peer_manager.c
ret_code_t pm_peer_rank_highest(pm_peer_id_t peer_id)
{
#if PM_PEER_RANKS_ENABLED == 0
    return NRF_ERROR_NOT_SUPPORTED;
#else
    VERIFY_MODULE_INITIALIZED();

    ret_code_t err_code;
    //lint -save -e65 -e64
    pm_peer_data_flash_t peer_data   = {.length_words = BYTES_TO_WORDS(sizeof(m_current_highest_peer_rank)),
                                        .data_id      = PM_PEER_DATA_ID_PEER_RANK,
                                        .p_peer_rank  = &m_current_highest_peer_rank};
    //lint -restore


    if (!m_peer_rank_initialized)
    {
        rank_init();
    }

    if (!m_peer_rank_initialized || (m_peer_rank_token != PM_STORE_TOKEN_INVALID))
    {
        err_code = NRF_ERROR_BUSY;
    }
    else
    {
        if ((peer_id == m_highest_ranked_peer) && (m_current_highest_peer_rank > 0))
        {
            pm_evt_t pm_evt;

            // The reported peer is already regarded as highest (provided it has an index at all)
            err_code = NRF_SUCCESS;

            memset(&pm_evt, 0, sizeof(pm_evt));
            pm_evt.evt_id      = PM_EVT_PEER_DATA_UPDATE_SUCCEEDED;
            pm_evt.conn_handle = im_conn_handle_get(peer_id);
            pm_evt.peer_id     = peer_id;
            pm_evt.params.peer_data_update_succeeded.data_id       = PM_PEER_DATA_ID_PEER_RANK;
            pm_evt.params.peer_data_update_succeeded.action        = PM_PEER_DATA_OP_UPDATE;
            pm_evt.params.peer_data_update_succeeded.token         = PM_STORE_TOKEN_INVALID;
            pm_evt.params.peer_data_update_succeeded.flash_changed = false;

            evt_send(&pm_evt);
        }
        else
        {
            if (m_current_highest_peer_rank == UINT32_MAX)
            {
                err_code = NRF_ERROR_RESOURCES;
            }
            else
            {
                m_current_highest_peer_rank += 1;
                err_code = pds_peer_data_store(peer_id, &peer_data, &m_peer_rank_token);
                if (err_code != NRF_SUCCESS)
                {
                    m_peer_rank_token    = PM_STORE_TOKEN_INVALID;
                    m_current_highest_peer_rank -= 1;
                    if ((err_code != NRF_ERROR_BUSY) &&
                        (err_code != NRF_ERROR_STORAGE_FULL) &&
                        (err_code != NRF_ERROR_INVALID_PARAM)) // Assume INVALID_PARAM refers to peer_id, not data_id.
                    {
                        NRF_LOG_ERROR("Could not update rank. pdb_raw_store() returned %s. "\
                                      "peer_id: %d",
                                      nrf_strerror_get(err_code),
                                      peer_id);
                        err_code = NRF_ERROR_INTERNAL;
                    }
                }
            }
        }
    }
    return err_code;
#endif
}
#endif // NRF_MODULE_ENABLED(PEER_MANAGER)
